In [9]:
import pandas as pd
import os

In [10]:
os.chdir('F:\\Vikas\\codebasics exercise\\py-master')

In [15]:
df = pd.read_csv("F:\\Vikas\\codebasics exercise\\py-master\\ML\\9_decision_tree\\Exercise\\titanic.csv")

In [34]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
df.shape

(891, 12)

In [17]:
inputs = df.drop(columns=['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [18]:
target = df['Survived']

In [20]:
from sklearn.preprocessing import LabelEncoder
le_Pclass = LabelEncoder()
le_Sex = LabelEncoder()
le_degree = LabelEncoder()
le_Fare = LabelEncoder()

In [21]:
inputs['Pclass_n'] = le_company.fit_transform(inputs['Pclass'])
inputs['Sex-n'] = le_job.fit_transform(inputs['Sex'])
inputs['Age_n'] = le_degree.fit_transform(inputs['Age'])
inputs['Fare_n'] = le_degree.fit_transform(inputs['Fare'])

In [23]:
inputs.head()

   Survived  Pclass     Sex   Age     Fare  Pclass_n  Sex-n  Age_n  Fare_n
0         0       3    male  22.0   7.2500         2      1     28      18
1         1       1  female  38.0  71.2833         0      0     51     207
2         1       3  female  26.0   7.9250         2      0     34      41
3         1       1  female  35.0  53.1000         0      0     47     189
4         0       3    male  35.0   8.0500         2      1     47      43

In [26]:
inputs_n = inputs.drop(['Survived','Pclass','Sex','Age','Fare'],axis='columns')

In [28]:
inputs_n.head()

   Pclass_n  Sex-n  Age_n  Fare_n
0         2      1     28      18
1         0      0     51     207
2         2      0     34      41
3         0      0     47     189
4         2      1     47      43

In [30]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [31]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [32]:
model.fit(inputs_n, target)

C:\Users\vksk0\Anaconda3\lib\site-packages\sklearn\tree\tree.py:149: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  y_encoded = np.zeros(y.shape, dtype=np.int)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [33]:
model.score(inputs_n,target)

0.9797979797979798

In [43]:
model.predict([[2,1,28,18]])

array([0], dtype=int64)